# RbsCurvetypeMultishapeTransitionParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurvetypeMultishapeTransitionParam Property
ParameterTypeId Class See Also
---
"Multi Shape Transition Rect to Round"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypeMultishapeTransitionParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypeMultishapeTransitionParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypeMultishapeTransitionParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace